src/cf/Catalogs/уатПрофилиОбменаСВнешнимиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПрофилиОбменаСВнешнимиСистемами</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛДоВыезда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаПоискаПЛПослеВозвращения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьАналогНаОсновноеТопливо</Name>
					<Comment>Заменять аналог на основное топливо (уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментироватьХодВыполнения</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрабатыватьРассчитанныеПутевыеЛисты</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФормыЗаписанныхЗаправок</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитатьПутевыеЛисты</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьНаличиеДублейПоСозданнымРанееДокументам</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьСозданныеЗаправкиГСМ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСоответствияКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПроверенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНаценкиСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработкиЗаправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработкиСливов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоздаватьСливыДляОтрицательныхЗаправок</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонкиФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолонкаДокументаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонкиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользованиеВсегда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыВнешнихСистем</Name>
			<Comment>Типы внешних систем (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессинговыйЦентр</Name>
					<Comment>Процессинговый центр.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаВзиманияПлаты</Name>
					<Comment>Система взимания платы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисШтрафов</Name>
					<Comment>Сервис штрафов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПарковок</Name>
					<Comment>Сервис парковок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисГеоданных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	Элементы.ТипСистемы.СписокВыбора.Очистить();
	Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр);
	Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты);
	
	ИспользоватьСтрахование = ПолучитьФункциональнуюОпцию("уатИспользоватьСтрахование_уэ");
	Если ИспользоватьСтрахование Тогда
		Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СервисСтрахования);
	КонецЕсли;

	ИспользоватьМониторинг = ПолучитьФункциональнуюОпцию("уатИспользоватьМониторинг");
	Если ИспользоватьМониторинг Тогда
		Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаМониторинга);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипСистемы") Тогда
		Объект.ТипСистемы = Параметры.ТипСистемы;
	КонецЕсли;
	Если Параметры.Свойство("ВнешняяСистема") Тогда
		Объект.ВнешняяСистема = Параметры.ВнешняяСистема;
	КонецЕсли; 
	
	Если Объект.СоответствиеКолонок.Количество() = 0 Тогда
		ИнициализацияСоответствияКолонок();
	КонецЕсли;
	
	
	Если Параметры.Свойство("Режим") Тогда
		Если Параметры.Режим = 2 Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗагрузкаЗаправок;
		КонецЕсли;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.РежимОбработкиСливов) Тогда
		Объект.РежимОбработкиСливов = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСистемыПриИзменении(Элемент)
	
	Если Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		И уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
		ТекстНстр = Нстр("ru = 'Интеграция с системой взимания платы ""Платон"" и ""Автодор"" не доступна в текущей версии программы. Интеграция доступна в версии ПРОФ и КОРП'; en = 'Integration with the Platon and Avtodor toll collection systems is not available in the current version of the program. Integration is available in the PROF and CORP versions.'");
		ПоказатьПредупреждение(, ТекстНстр);
		Возврат;
	КонецЕсли;
	
	Объект.ГлубинаПоискаПЛДоВыезда							 = Неопределено;
	Объект.ГлубинаПоискаПЛПослеВозвращения					 = Неопределено;
	Объект.ТолькоПроверенные								 = Неопределено;
	Объект.ОбрабатыватьРассчитанныеПутевыеЛисты				 = Неопределено;
	Объект.ПересчитатьПутевыеЛисты							 = Неопределено;
	Объект.КомментироватьХодВыполнения						 = Неопределено;
	Объект.ПроводитьСозданныеЗаправкиГСМ					 = Неопределено;
	Объект.РежимОбработкиСливов								 = 2;
	Объект.ПроверятьНаличиеДублейПоСозданнымРанееДокументам	 = Неопределено;
	Объект.ОткрыватьФормыЗаписанныхЗаправок					 = Неопределено;
	Объект.ТипСоответствияКолонок = 1;

	УстановитьВидимостьДоступность();
	ИнициализацияСоответствияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСоответствияКолонокПриИзменении(Элемент)
	ОчиститьНомераИменаКолонок();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяСистемаПриИзменении(Элемент)
	
	Если Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		И уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
		ТекстНстр = Нстр("ru = 'Интеграция с системой взимания платы ""Платон"" и ""Автодор"" не доступна в текущей версии программы. Интеграция доступна в версии ПРОФ и КОРП'; en = 'Integration with the Platon and Avtodor toll collection systems is not available in the current version of the program. Integration is available in the PROF and CORP versions.'");
		ПоказатьПредупреждение(, ТекстНстр);
		Возврат;
	КонецЕсли;

	Объект.ГлубинаПоискаПЛДоВыезда							 = Неопределено;
	Объект.ГлубинаПоискаПЛПослеВозвращения					 = Неопределено;
	Объект.ТолькоПроверенные								 = Неопределено;
	Объект.ОбрабатыватьРассчитанныеПутевыеЛисты				 = Неопределено;
	Объект.ПересчитатьПутевыеЛисты							 = Неопределено;
	Объект.КомментироватьХодВыполнения						 = Неопределено;
	Объект.ПроводитьСозданныеЗаправкиГСМ					 = Неопределено;
	Объект.РежимОбработкиСливов								 = 2;
	Объект.ПроверятьНаличиеДублейПоСозданнымРанееДокументам	 = Неопределено;
	Объект.ОткрыватьФормыЗаписанныхЗаправок					 = Неопределено;
	Объект.ТипСоответствияКолонок = 1;

	УстановитьВидимостьДоступность();
	ИнициализацияСоответствияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОбработкиЗаправокПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствиеКолонок

&НаКлиенте
Процедура СоответствиеКолонокИспользованиеПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ИмяКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКолонокИмяКолонкиФайлаПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ИмяКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКолонокНомерКолонкиФайлаПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.НомерКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуСервер();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьНомераИменаКолонок()
	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если Объект.ТипСоответствияКолонок = 0 Тогда
			ТекСтрока.НомерКолонкиФайла = 0;
		Иначе
			ТекСтрока.ИмяКолонкиФайла = "";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	флагПЦ         = Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
	флагМониторинг = Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаМониторинга");
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	
	Элементы.ГруппаНастройкиДополнительноИнформация.Видимость = Истина;
	Если флагПЦ Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Истина;
		Элементы.ГруппаНастройки.Видимость			 = Истина;
	ИначеЕсли Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		ИЛИ Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СервисСтрахования") Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Ложь;
		Элементы.ГруппаНастройки.Видимость			 = Истина;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет; 
	ИначеЕсли флагМониторинг Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Истина;
		Элементы.ГруппаНастройки.Видимость			 = Ложь;
	Иначе
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Ложь;
		Элементы.ГруппаНастройки.Видимость			 = Ложь;
		Элементы.Страницы.ОтображениеСтраниц		 = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	Элементы.ТолькоПроверенные.Видимость						 = флагПЦ;
	Элементы.РежимОбработкиСливов.Видимость						 = флагПЦ ИЛИ флагМониторинг;
	Элементы.РежимОбработкиЗаправок.Видимость					 = флагПЦ ИЛИ флагМониторинг;
	Элементы.ФлажокКомментироватьХодВыполнения.Видимость		 = флагПЦ; 
	Элементы.ОткрыватьФормыЗаписанныхЗаправок.Видимость			 = флагПЦ;

	
	Элементы.ГруппаНастройки.Видимость          = НЕ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Роснефть");
	Элементы.УчитыватьНаценкиСкидки.Видимость   = Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Роснефть");
	Элементы.СтраницаЗагрузкаДанныхПЦ.Видимость = НЕ (Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.ППР")
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Лукойл")
		ИЛИ Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаМониторинга"));
		
	Элементы.ЗаполнитьПоШаблону.Видимость = Объект.Предопределенный;
	
	Если Объект.ТипСоответствияКолонок = 0 Тогда
		Элементы.СоответствиеКолонокИмяКолонкиФайла.Видимость = Истина;
		Элементы.СоответствиеКолонокНомерКолонкиФайла.Видимость = Ложь;
	Иначе
		Элементы.СоответствиеКолонокИмяКолонкиФайла.Видимость = Ложь;
		Элементы.СоответствиеКолонокНомерКолонкиФайла.Видимость = Истина;
	КонецЕсли;  
	
	Если флагМониторинг Тогда
		Элементы.РежимОбработкиЗаправок.Подсказка = Нстр("ru = 'При установленном режиме работы ""Создавать заправку"" по всем записям c типом события ""Заправка ГСМ"", будут сформированы документы ""Заправка ГСМ"".
                                                          |При установленном режиме работы ""Пропускать строки"" строки с типом события ""Заправка ГСМ"" будут пропущены. '");
		Элементы.РежимОбработкиСливов.Подсказка   = Нстр("ru = 'При установленном режиме работы ""Создавать слив"" по всем записям c типом события ""Слив ГСМ"" будут сформированы документы ""Слив ГСМ"".
                                                         |
                                                         |При установленном режиме работы ""Уменьшать заправку"" количество “Слива ГСМ” вычитается из “Заправок ГСМ”, соответствующих по ключевым полям. 
                                                         |Например, при загрузке  двух строк “Заправка ГСМ” с количеством 30 и “Слива ГСМ” с количеством 5, будет создана одна “Заправка ГСМ” с количеством 25.
                                                         |Заправки могут быть модифицированы с разницей во времени от текущего слива не более 1 часа.
                                                         |Если для “Сливов ГСМ” не найдены соответствующие “Заправки ГСМ”, будут сформированы документы ""Слив ГСМ"".
                                                         |
                                                         |При установленном режиме работы ""Пропускать строки"" строки с типом события ""Слив ГСМ"" будут пропущены. '");
		 Элементы.ДекорацияНазначение.Заголовок = Нстр("ru = 'Настройки применяются только при использовании обработки ""Загрузка заправок по данным мониторинга""'; en = 'The settings are applied only when using the ""Loading gas stations based on monitoring data"" processing.'");
	Иначе
		Элементы.РежимОбработкиЗаправок.Подсказка = Нстр("ru = 'При установленном режиме работы ""Создавать заправку"" для строк с положительным количеством будут сформированы документы ""Заправка ГСМ"".
                                                         |При установленном режиме работы ""Пропускать строки"" строки с положительным  количеством будут пропущены. '");
		Элементы.РежимОбработкиСливов.Подсказка   = Нстр("ru = 'При установленном режиме работы ""Создавать слив""  для строк с отрицательным количеством будут сформированы документы ""Слив ГСМ"".
                                                         |
                                                         |При установленном режиме работы ""Уменьшать заправку"" количество “Слива ГСМ” вычитается из “Заправок ГСМ”, соответствующих по ключевым полям. 
                                                         |Например, при загрузке  двух строк “Заправка ГСМ” с количеством 30 и “Слива ГСМ” с количеством 5, будет создана одна “Заправка ГСМ” с количеством 25.
                                                         |Заправки могут быть модифицированы с разницей во времени от текущего слива не более 1 часа.
                                                         |Если для “Сливов ГСМ” не найдены соответствующие “Заправки ГСМ”, будут сформированы документы ""Слив ГСМ"".
                                                         |
                                                         |При установленном режиме работы ""Пропускать строки"" строки с отрицательным количеством будут пропущены. '");
		Элементы.ДекорацияНазначение.Заголовок = Нстр("ru = 'Настройки применяются только при использовании обработки ""Загрузить заправки ГСМ из отчетов ПЦ""'; en = 'The settings are applied only when using the ""Download fuel refills from PC reports"" processing.'");
	КонецЕсли;
	
	Элементы.РежимОбработкиСливов.СписокВыбора.Очистить();
	Если Объект.РежимОбработкиЗаправок = 1 Тогда
		Элементы.РежимОбработкиСливов.СписокВыбора.Добавить(1, Нстр("ru = 'Создавать слив'; en = 'Create a drain'"));
		Элементы.РежимОбработкиСливов.СписокВыбора.Добавить(3, Нстр("ru = 'Пропускать строки'; en = 'Skip lines'"));
		Если Объект.РежимОбработкиСливов = 2 Тогда
			Объект.РежимОбработкиСливов = 1;
		Конецесли;
	Иначе
		Элементы.РежимОбработкиСливов.СписокВыбора.Добавить(1, Нстр("ru = 'Создавать слив'; en = 'Create a drain'"));
		Элементы.РежимОбработкиСливов.СписокВыбора.Добавить(2, Нстр("ru = 'Уменьшать заправку'; en = 'Reduce refueling'"));
		Элементы.РежимОбработкиСливов.СписокВыбора.Добавить(3, Нстр("ru = 'Пропускать строки'; en = 'Skip lines'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИнициализацияСоответствияКолонок()
	
	Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонок(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуСервер()
	Если Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Газпромнефть Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокГазпромнефть(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонВыпискаОпераций Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокПлатонВыпискаОпераций(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонЛогистическийОтчет Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокПлатонЛогистическийОтчет(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Автодор Тогда  
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокАвтодор(Объект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
